# RoomTagBadViewType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..RoomTagBadViewType Property
BuiltInFailures..::..RoomFailures Class See Also
---
[Room] Tags can only be placed in Floor Plan, Reflected Ceiling Plan and Section Views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomTagBadViewType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomTagBadViewType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomTagBadViewType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace